{
   "users":[
      {
         "id": 1,
         "name":"Joao",
         "lastname":"Antunes",
         "username":"Jhorta",
         "password":"555555",
         "booksRead": 0,
         "avatar":"https://cdn-icons-png.flaticon.com/512/4792/4792929.png"
      }
       {
         "id": 2,
         "name":"Joao2",
         "lastname":"Antunes2",
         "username":"jhorta",
         "password":"2846jh",
         "booksRead": 0,
         "avatar":"https://cdn-icons-png.flaticon.com/512/4792/4792929.png"
      }
   ],
   "categories": [
      {
         "id": 1,
         "name": "Romance"
      },
      {
         "id": 2,
         "name": "Thriller"
      },
       {
         "id": 3,
         "name": "Horror"
      },
       {
         "id": 4,
         "name": "Aventure"
      },
       {
         "id": 5,
         "name": "sci-fi"
      },
       {
         "id": 6,
         "name": "Biografy"
      },
       {
         "id": 7,
         "name": "Crime"
      },
       {
         "id": 8,
         "name": "War"
      },
      {
         "id": 9,
         "name": "Drama"
      }
    ],
   "books":[
      {
         "id": 1,
         "name":"Lusiadas",
         "author":"luis de camoes",
         "image":"https://www.lojadomuseudemarinha.pt/pub/media/catalog/product/cache/877042223109cc2bc0869ffe42af0ed8/1/0/101634-os-lusiadas-lado.jpg",
         "synopses":"Os Lusíadas, de Luís de Camões, é o livro mais famoso da literatura portuguesa e fala das conquistas lusitanas até a chegada de Vasco da Gama à Índia. Assim, o narrador da epopeia demonstra seu amor e veneração ao rei de Portugal, D. Sebastião, e ao povo lusitano.",
         "read": 0,
         "category": "Aventure"
      },
      {
         "id": 2,
         "name":"Dom Quixote",
         "author":"Miguel de Cervantes",
         "image":"https://upload.wikimedia.org/wikipedia/commons/0/08/Miguel_de_Cervantes_%281605%29_El_ingenioso_hidalgo_Don_Quixote_de_la_Mancha.png",
         "synopses":"O livro narra a história do engenhoso fidalgo Dom Quixote e de seu fiel escudeiro Sancho Pança em três incursões pelas terras da Mancha, região de Aragão e da Catalunha, na Espanha. Dom Quixote adora ler histórias de cavalaria e, de tão influenciado por elas, enlouquece e sai em busca de aventuras memoráveis, tentando imitar seus heróis favoritos e levando consigo Sancho Pança, que tem uma visão mais realista dos fatos.",
         "read": 0,
         "category": "Aventure"
      },
      {
         "id": 3,
         "name":"O Grande Gatsby",
         "author":"F. Scott Fitzgerald",
         "image":"https://m.media-amazon.com/images/I/81BmIqvcNFL.jpg",
         "synopses":"é um livro sobre a Era do Jazz nos EUA, os anos prósperos e loucos que sucederam a Primeira Guerra Mundial. Nick Carraway, um jovem comerciante, se torna amigo de seu vizinho, Jay Gatsby, um bilionário conhecido por dar festas animadas em sua mansão, em Long Island. ",
         "read": 0,
         "category": "War"
      },
      {
         "id": 4,
         "name":"Moby Dick",
         "author":"Herman Melville",
         "image":"https://m.media-amazon.com/images/I/41VnFKC9srL._AC_SY780_.jpg",
         "synopses":"A clássica obra de Herman Melville é centrada em Ismael, um marinheiro letrado, que, para fugir de sua vida monótona, decide conhecer a rotina de um navio baleeiro, o Pequod. No entanto, o que ele não sabia é que o capitão da embarcação, Ahab, tinha apenas um objetivo: matar Moby Dick, uma gigante baleia branca que arrancou sua perna no passado. Ismael, então, embarca em uma perigosa aventura em alto-mar para acompanhar o capitão.",
         "read": 0,
         "category": "Aventure"
      },
       {
         "id": 5,
         "name":"Guerra e Paz",
         "author":"Lev Tolstói",
         "image":"https://www.revistabula.com/wp/wp-content/uploads/2020/05/Guerra-e-Paz-610x884.jpg",
         "synopses":"Uma das obras mais volumosas da história, “Guerra e Paz” narra a história da Rússia à época de Napoleão Bonaparte. Ao acompanhar o percurso de cinco famílias aristocráticas russas no período de 1805 a 1820, Tolstói narra a marcha das tropas napoleônicas e seu impacto brutal sobre a vida de centenas de personagens. ",
         "read": 0,
         "category": "War"
      },
      {
         "id": 6,
         "name":"Lolita",
         "author":"Vladimir Nabokov",
         "image":"https://www.revistabula.com/wp/wp-content/uploads/2020/03/Lolita.jpg",
         "synopses":"é um dos mais importantes romances do século 20. Polêmico e irônico, ele narra o amor obsessivo de Humbert Humbert, um cínico intelectual de meia-idade, por Dolores Haze, Lolita, de 12 anos. Humbert se casa com a mãe de Lolita e, após a morte da esposa, começa a se relacionar com a garota. Para evitar que Lolita fuja, ele alega que ela será enviada para um orfanato se o deixar. Humbert também manipula a garota com dinheiro e presentes, em troca de favores sexuais.",
         "read": 0,
         "category": "Romance"
      },
       {
         "id": 7,
         "name":"Hamlet",
         "author":"William Shakespeare",
         "image":"https://www.revistabula.com/wp/wp-content/uploads/2020/03/Hamlet.jpg",
         "synopses":"O Rei Hamlet de Dinamarca acaba de morrer, deixando seu filho, o Príncipe Hamlet, e a viúva Rainha Gertrudes. O irmão do Rei, Cláudio, logo se casa com Gertrudes, assumindo o trono. Certa noite, um fantasma aparece ao príncipe, alegando ser seu pai, e revela que foi morto por Cláudio, que o envenenou. O Príncipe Hamlet passa dias perturbado e recluso, sem saber se deve acreditar no espírito, até que descobre como saber a verdade.",
         "read": 0,
         "category": "Drama"
      },
       {
         "id": 8,
         "name":"O Apanhador no Campo de Centeio",
         "author":"J.D. Salinger",
         "image":"https://www.revistabula.com/wp/wp-content/uploads/2020/03/O-Apanhador-no-Campo-de-Centeio.jpg",
         "synopses":"O livro acompanha um fim de semana da vida de Holden Caulfield, um jovem de 17 anos, estudante de um respeitado internato para rapazes, o Colégio Pencey. Ele é expulso da escola depois de tirar notas ruins, e precisa voltar mais cedo para casa no inverno. Durante o caminho de volta, o rapaz busca adiar ao máximo o encontro com os pais, fazendo uma viagem reflexiva sobre sua existência, a partir de sua peculiar visão de mundo.",
         "read": 0,
         "category": "Drama"
      }
   ]
}
